src/cf/Catalogs/инт_ПодписчикиJRPC.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_ПодписчикиJRPC</Name>
			<Comment>Подписчики для отправки по JSON-RPC 2.0</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Эндпоинт</Name>
					<Comment>HTTP-сервер JSON-RPC</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Эндпоинты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПостПроцессинг</Name>
					<Comment>Обработчики по кодам HTTP-ответа</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСостояния</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Comment>BSL-код обработчика</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/инт_ОчередьИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ОчередьИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.инт_ИсходныеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СформированноеСообщение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/инт_ПодписчикиJRPC/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////
// инт_ПодписчикиJRPC (Модуль менеджера)
// Подписчики для отправки по JSON-RPC 2.0
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует сообщение для отправки
//
// Параметры:
//  ДанныеСообщения - Соответствие - Данные для сериализации
//  Подписчик - СправочникСсылка.инт_ПодписчикиJRPC - Ссылка на подписчика
//  ИдентификаторСообщения - УникальныйИдентификатор - УИД сообщения
//
// Возвращаемое значение:
//  Строка - Сериализованное сообщение
//
Функция СформироватьСообщение(ДанныеСообщения, Подписчик, ИдентификаторСообщения) Экспорт
    
    СтруктураПотока = РегистрыСведений.инт_ОчередьИсходящихСообщений.ПолучитьДанныеОчередиПоИдентификатору(ИдентификаторСообщения, "ПотокДанных");
    
    Если НЕ ЗначениеЗаполнено(СтруктураПотока.ПотокДанных) Тогда
        ВызватьИсключение СтрШаблон("Поток данных в сообщении с идентификатором <%1> не найден.", ИдентификаторСообщения);
    КонецЕсли;
    
    ИдентификаторПотока = инт_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураПотока.ПотокДанных, "Код");
    
    Если ИдентификаторПотока = Неопределено Тогда
        ВызватьИсключение "У потока данных отсутствует Идентификатор Потока (Код).";
    КонецЕсли;
    
    // Формат JSON-RPC 2.0
    СообщениеJRPC = Новый Структура;
    СообщениеJRPC.Вставить("jsonrpc", "2.0");
    СообщениеJRPC.Вставить("method", Строка(ИдентификаторПотока));
    СообщениеJRPC.Вставить("params", ДанныеСообщения);
    СообщениеJRPC.Вставить("id", Строка(ИдентификаторСообщения));
    
    Возврат инт_КоннекторHTTP.ОбъектВJson(СообщениеJRPC);
    
КонецФункции

// Отправляет сообщение подписчику
//
// Параметры:
//  Сообщение - Структура - Данные сообщения (ИдентификаторСообщения, Подписчик, СформированноеСообщение)
//  ОтложенныеДействия - Соответствие - Для пакетной обработки
//
Процедура ОтправитьСообщение(Сообщение, ОтложенныеДействия) Экспорт
    
    ДанныеСообщения = РегистрыСведений.инт_ОчередьИсходящихСообщений.ПолучитьДанныеОчередиПоИдентификатору(Сообщение.ИдентификаторСообщения, "ИсходныеДанные,ПотокДанных");

    Если НЕ ЗначениеЗаполнено(ДанныеСообщения.ПотокДанных) Тогда
        // Без записи в очереди исходные данные не заполнены и ушли бы в постобработку как штатные.
        ВызватьИсключение СтрШаблон("Данные сообщения с идентификатором <%1> не найдены.", Сообщение.ИдентификаторСообщения);
    КонецЕсли;
    
    Подписчик = Сообщение.Подписчик;
    
    СтруктураПараметровСоединения = Справочники.инт_Эндпоинты.СтруктураПараметровСоединения(Подписчик.Эндпоинт);
    
    Заголовки = Новый Соответствие;
    Заголовки.Вставить("Content-Type", "application/json");
    
    Ответ = инт_КоннекторHTTP.Post(
        СтруктураПараметровСоединения.АдресРесурса, 
        Сообщение.СформированноеСообщение, 
        Заголовки, 
        СтруктураПараметровСоединения.Сессия
    );
    
    // Постобработка по коду ответа
    ВыполнитьПостПроцессинг(Подписчик, Ответ, ДанныеСообщения.ИсходныеДанные);
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет постобработку по коду состояния HTTP-ответа
//
// Параметры:
//  Подписчик - СправочникСсылка.инт_ПодписчикиJRPC - Ссылка на подписчика
//  Ответ - Структура - Ответ HTTP-сервера (КодСостояния, Тело)
//  ИсходныеДанные - ОпределяемыйТип.инт_ИсходныеДанные - Ссылка на исходные данные сообщения
//
Процедура ВыполнитьПостПроцессинг(Подписчик, Ответ, ИсходныеДанные = Неопределено) Экспорт
    
    КодСостояния = Ответ.КодСостояния;

    Попытка
        ИмяОбработки = ИмяОбработчикаПоКодуСостояния(КодСостояния, Подписчик);
        Исполнить(ИмяОбработки, Ответ, ИсходныеДанные, Истина);
    Исключение
        ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); // BSLLS:DeprecatedMethods8317-off
        СообщениеОбОшибке = СтрШаблон("При пост-обработке ответа возникла ошибка!
        |
        | Информация об ошибке: %1",
        ПредставлениеОшибки);
        
        ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.Подписчики.ПостОбработкаОтвета",
                                    УровеньЖурналаРегистрации.Ошибка,
                                    Подписчик.Метаданные(),
                                    Подписчик,
                                    СообщениеОбОшибке);
        ВызватьИсключение;
    КонецПопытки;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает имя подключённой обработки пост-процессинга. Обработка подключается
// в кэше сеанса, поэтому пачка сообщений одной версии обработчика даёт одно подключение,
// а не одно на сообщение. Имя строится по подписчику и строке табличной части,
// поэтому обработчики разных подписчиков не замещают друг друга.
//
// Параметры:
//  КодСостояния - Число - Код состояния ответа
//  Подписчик - СправочникСсылка.инт_ПодписчикиJRPC - Ссылка на подписчика
//
// Возвращаемое значение:
//  Строка - Имя подключённой обработки. Пустая строка, если обработчик не задан
//
Функция ИмяОбработчикаПоКодуСостояния(КодСостояния, Подписчик)

    СтрокаОбработчика = инт_ВерсииОбработчиковПовтИсп.СтрокаПостОбработки(Подписчик, КодСостояния);
    ТекстОбработчика = СтрокаОбработчика.ТекстОбработчика;
    НомерСтроки = СтрокаОбработчика.НомерСтроки;

    Если Не ЗначениеЗаполнено(ТекстОбработчика) Тогда
        ТекстОбработчика = ПолучитьОбработчикПоУмолчанию(КодСостояния);
        НомерСтроки = 0;
    КонецЕсли;

    Если ПустаяСтрока(ТекстОбработчика) Тогда
        Возврат "";
    КонецЕсли;

    Возврат инт_ГенераторОбработокПовтИсп.ИмяПодключеннойОбработкиПодписчика(
        Подписчик, НомерСтроки, ТекстОбработчика);

КонецФункции

Функция ПолучитьОбработчикПоУмолчанию(КодСостояния)
    
    Обработчик = "";
    // Здесь через ИначеЕсли можно определить базовое поведение для разных кодов состояний.
    // Если их будет много - вынести в регистр
    Если НЕ (КодСостояния >= 200 И КодСостояния < 300) Тогда // BSLLS:MagicNumber-off ну коды http-то все знают
        Обработчик = "СообщениеОбОшибке = СтрШаблон(""При попытке отправки сообщения код ответа отличается от ожидаемого!
            |	|Код состояния: %1
            |	|ТелоОтвета: %2"", Ответ.КодСостояния, ПолучитьСтрокуИзДвоичныхДанных(Ответ.Тело));
            |ВызватьИсключение СообщениеОбОшибке;";
    КонецЕсли;
    Возврат Обработчик;
    
КонецФункции

Процедура Исполнить(ИмяОбработки, Ответ, ИсходныеДанные, РазрешитьФиксациюИзменений = Ложь)

    Если Не ЗначениеЗаполнено(ИмяОбработки) Тогда
        Возврат;
    КонецЕсли;

    инт_ГенераторОбработок.ИсполнитьОбработкуПодписчика(
        ИмяОбработки, Ответ, ИсходныеДанные, РазрешитьФиксациюИзменений);

КонецПроцедуры

#КонецОбласти
